---
kind: method
id: M:Autodesk.Revit.Exceptions.ArgumentException.GetObjectData(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
source: html/ffd259c2-53ec-f232-02e1-135ba0a6ccfd.htm
---
# Autodesk.Revit.Exceptions.ArgumentException.GetObjectData Method

Retrieves data needed to serialize the target object.

## Syntax (C#)
```csharp
public override void GetObjectData(
	SerializationInfo info,
	StreamingContext context
)
```

## Parameters
- **info** (`System.Runtime.Serialization.SerializationInfo`) - Data needed to serialize or deserialize the object.
- **context** (`System.Runtime.Serialization.StreamingContext`) - The destination of the serialized stream.